app/controllers/blocklists_controller.rb

  def index
    @blocklists = Blocklist.all
---
SELECT `blocklists`.* FROM `blocklists`