app/controllers/users_controller.rb

  def index
    blocks = Blocklist.all.select('ListAgentEmail')
    @users = User.where('ListAgentEmail NOT IN (?)', blocks)
---
SELECT `users`.* FROM `users` WHERE (ListAgentEmail NOT IN (SELECT `blocklists`.`ListAgentEmail` FROM `blocklists`))